Repository: Gaploid/Rawer
Catalog: Rawer/Resources/AppResources.*.resx
Languages: ar, ru

# AboutPageAppBarFeedback
source: Feedback
ar: مراجعة
ru: Отзыв

# AboutPageEmailText
source: Contact email:
ar: بريد التواصل:
ru: Контактная почта:

# AboutPageMainText
source: Open and edit RAW Camera photos. Notice: Due to memory limitation on low memory phones, the app can open large images in half size.
ar: فتح وتعديل الصور الخام (Raw) ملاحظة:بسبب تحديد الذاكرة في الهواتف ذات الذاكرة القليلة, يستطيع التطبيق في الصور الكبيرة بنصف الحجم
ru: Просмотр и редактирование фотографий в RAW формате. Внимание: На телефонах с небольшим количеством оперативной памяти есть вероятность того, что при открытии больших фотографии, приложение откроет их в половинном размере.

# AboutPageTitle
source: About
ar: عن التطبيق
ru: О приложении

# AboutPageVersionText
source: Version:
ar: الإصدار:
ru: Версия:

# DiagnosticEmailBody
source: Oops, something going wrong. Sorry for that. Im giving you a word that it will be fixed if you send us error report by pressing OK button. Thanks in advance.
ar: نأسف حدث خطأ ما. نعدك أن نصلح هذا الخطأ اذا ارسلت لنا الخطأ بالضغط على زر الموافقة شكراً مقدماً
ru: Упс, что-то пошло не так. Это очень печально и непростительно. Мы моментально приступим к исправлению этой ошибки, как только вы пришлите отчет об ошибки, нажав на кнопку отправить. Большущее спасибо заранее.

# DiagnosticEmailTitle
source: Application error
ar: خطأ في التطبيق
ru: Ошибка

# ReminderContent
source: Its extremely important for us to know what you think about this app. Please rate and review this app.
ar: أنه من المهم جداً بالنسبة لنا معرفة رأيك عن هذا التطبيق. الرجاء تقييم ومراجعة هذ التطبيق
ru: Нам супер важно понять, что вы думаете о приложении или, что вам в нем не нравится. Пожалуйста поставьте оценку и напишите пару строк ваших мыслей об этом приложении.

# ReminderSkipFurther
source: Skip further reminders
ar: تخطي التنبيهات المستقبلية
ru: Больше не показывать.

# ReminderSkipFurtherTitle
source: Rate My App
ar: قيّم التطبيق
ru: Оцените приложение

# ResourceLanguage
source: en-US
ar: ar
ru: ru

# UpgradeFinal
source: Successfully upgraded. Now you can edit photos in app.
ar: تمت الترقية بنجاح. يمكنك تعديل الصورة من التطبيق
ru: Все прошло отлично. Теперь вы можете редактировать фотографии в приложении.

# ViewerPageAppBarAbout
source: about
ar: عن التطبيق
ru: о приложении

# ViewerPageAppBarEdit
source: Edit
ar: تعديل
ru: редактор

# ViewerPageAppBarExif
source: Info
ar: معلومات
ru: exif

# ViewerPageAppBarSave
source: Save
ar: حفظ
ru: сохранить

# ViewerPageAppBarShare
source: Share
ar: مشاركة
ru: рассказать

# ViewerPageAppBarUpgrade
source: upgrade app
ar: ترقية التطبيق
ru: улучшить приложение

# ViewerPageLowMemoryBody
source: Looks like you have not enough memory to open this image in full size. Do not worry we will try to open it in half size if you do not mind.
ar: يبدو انه ليس لديك الذاكرة الكافية لفتح الصورة في كامل دقتها. لا تقلق سوف نفتحها بنصف الدقة
ru: Похоже, что у вас не хватает памяти на телефоне, что бы открыть это изображение в полный размер. Попробуем открыть это изображение в половинном размере.

# ViewerPageLowMemoryTitle
source: Tip
ar: نصيحة
ru: Информация

# ViewerPageProgressSavingTitle
source: Saving picture
ar: حفظ الصورة...
ru: Сохраняем изображение...

# ViewerPageProgressSharingTitle
source: working...
ar: نعمل...
ru: Ожидайте...

# ViewerPageSaveCompleted
source: Your picture is saved to phone "Saved Pictures" album.
ar: تم حفظ الصورة لمكتبة صور الهاتف
ru: Ваше изображение сохранено в медиа библиотеку вашего телефона.

# ViewerPageTrialBody
source: Upgrade app to edit RAW photos right from your phone. Change contrast, exposure, brightness, saturation, sharpness, hue and etc.
ar: ترقية التطبيق تجلعك قادراً على معالجة الصورة وتعديلها مباشرةً من هاتفك
ru: Добавьте возможность редактировать RAW фотографии прямо с вашего телефона. Изменять контрастность, экспозицию, яркость, насыщенность цвета, резкость, изменять оттенки.

# ViewerPageTrialcontinueButton
source: cancel
ar: إلغاء
ru: Продолжить

# ViewerPageTrialOkButton
source: upgrade
ar: ترقية
ru: улучшить

# ViewerPageTrialTitle
source: Upgrade
ar: ترقية
ru: Улучшение приложения

# ImageInfoPageAperture
source: Aperture
ar: فتحة العدسة
ru: Диафрагма

# ImageInfoPageAuthor
source: Author
ar: المصور
ru: Автор

# ImageInfoPageDescription
source: Description
ar: الوصف
ru: Описание

# ImageInfoPageFlash
source: Flash
ar: الفلاش
ru: Вспышка

# ImageInfoPageFocal
source: Focal
ar: البعد البؤري
ru: Фокусное расстояние

# ImageInfoPageHeight
source: Height
ar: الطول
ru: Высота

# ImageInfoPageManufacture
source: Manufacture
ar: المُصنع
ru: Производитель

# ImageInfoPageModel
source: Model
ar: نوع الجهاز
ru: Модель

# ImageInfoPageName
source: Name
ar: الاسم
ru: Название

# ImageInfoPageShotOrder
source: Shot order
ar: ترتيب اللقطة
ru: Номер

# ImageInfoPageShutter
source: Shutter
ar: سرعة غالق العدسة
ru: Выдержка

# ImageInfoPageSize
source: Size
ar: الحجم
ru: Размер

# ImageInfoPageSizeOnDisk
source: Size on disk
ar: الحجم على الذاكرة
ru: Размер на диске

# ImageInfoPageSoftware
source: Software
ar: البرنامج
ru: ПО

# ImageInfoPageTime
source: Time
ar: الوقت
ru: Дата

# ImageInfoPageTitle
source: Info
ar: معلومات
ru: Информация

# ImageInfoPageWidth
source: Width
ar: العرض
ru: Ширина

# ViewerPageLoaderMainText
source: working...
ar: نعمل...
ru: загрузка...

# ViewerPageLoaderText
source: Opening and Processing…
ar: نفتح الصورة ونعالجها لنجعلها جاهزة للعرض
ru: Это может занять некоторое время. Тем временем почитайте интересные советы и факты о фото.

# ViewerPageLoaderText1
source: A camera's auto-focus works by comparing contrast between pixels. Sometimes rotating the camera can help achieve a better focus!
ar: صورة لا تصدق! ألوان رائعة
ru: Автофокус в фотоаппарате работает по принципу сравнения контрастности рядом лежащих пикселей. Иногда перевернув камеру можно добиться лучшей фокусировки!

# ViewerPageLoaderText2
source: Photo sensors on the matrix of all cameras are black and white. Manufacturers use different methods, lenses and refraction of light to capture color.
ar: يجب أن تكون فخوراً بهذه الصورة
ru: Фото сенсоры на матрице всех фотоаппаратов черно-белые. Производители используют разные методы, линзы и преломление света, чтобы улавливать цвета.

# ViewerPageLoaderText3
source: To get color on each sensor/pixel, manufacturers are using micro-lenses and prisms or color filters to refract light and send it to separate photo sensors of the corresponding color
ar: سأعالج الالوان واضيف ابتسامة إلى الوجوه العابسة
ru: Чтобы получить на каждом сенсоре/пикселе цвет используют микролинзы и призмы или цветовые фильтры, чтобы раскладывать свет на цвета и передавать его на фото сенсор.

# ViewerPageLoaderText4
source: The larger the aperture is open or lower its value the less depth of field and more blurred background.
ar: هذه الصورة مذهلة. اجعبتني الألوان
ru: Чем больше открыта диафрагма/меньше ее значение, тем меньше глубина резкости и сильнее размывается фон.

# ViewerPageLoaderText5
source: Try to place the main subject at the golden section. The main object should cover 2/3 of picture. People typically think such images are more beautiful.
ar: تقريباً انتهينا ... ثانية واحدة ... أو اثنتين ... أو خمس
ru: Постарайтесь размещать главный объект в точке золотого сечения. Это примерно на линии 2/3. Человек автоматически воспринимает такие снимки более красивыми.

# ViewerPageLoaderText6
source: The first "photo paper" was made out of asphalt. Coated asphalt was varnished on a copper or glass plate.
ar: ستجعلني هذه الصورة اكتب رسالة إلى عائلتي لأخبرهم عن روعتها
ru: Фото с тремя планами дает эффект глубины. На переднем плане может быть часть дерева, на втором человек и на третьем - небо или лес.

# ViewerPageLoaderText7
source: Photos with three subjects have the effect of depth. On the foreground can be part of a tree, the second can be a person and the third - the sky or forest.
ar: تبدو كمحترف حقيقي. ارفع قبعتي احتراماً لك
ru: Зум на камерах в телефонах и других дешевых камерах всегда является композитным. После какого-то значения зума изображение просто увеличивается и обрезается в цифровом виде. Лучше выключить опцию digital зума, так как вы всегда сможете сделать это в пост обработке.

# ViewerPageLoaderText8
source: The zoom function on a phone's cameras and other cheaper cameras is always composite. After a certain threshold, the camera just starts to magnify and crop the image digitally. It is better to disable the digital zoom. You can replicate the effect in post-processing while maintaining a higher-quality image.
ar: هذه الصورة رائعة لدرجة حرب مزايدات بين المتاحف للحصول عليها
ru: Высокочастотный цветной шум (фото с телефона) намного эффективнее убирать в цветовой схеме YCbCr нежели в RGB и других.

# ViewerPageLoaderText9
source: The high-frequency color noise (photo from the phone) is much more effective to clean in YCbCr color mode than in RGB and others color modes.
ar: جميلة جداً من ناحية التركيز والتشويش
ru: Один из самых больших объективов, который можно свободно купить весит 15 кг. и стоит $26 000. Sigma 200-500/2.8

# ImageInfoPageMp
source: MP
ru: Мп

# ImageInfoPageNo
source: No
ar: لا
ru: Нет

# ImageInfoPageSec
source: sec
ar: ثانية
ru: сек

# ImageInfoPageYes
source: Yes
ar: نعم
ru: Да

# MainPageMainButton
source: open file
ar: فتح ملف
ru: открыть файл

# LIBRAW_COMMON_ERROR_text
source: Looks like something wrong with your file. Sorry for that. Maybe it was corrupted during downloading try to re load it.
ar: شيء خاطئ حصل مع هذه الصورة. ربما تضررت من عملية التنزيل حاول مرة اخرى.
ru: Похоже, ваш файл поврежден. Это очень печально. Может быть он был поврежден во время загрузки, попробуйте скачать его заново.

# LIBRAW_COMMON_ERROR_title
source: Oops
ru: Упс

# LIBRAW_FILE_UNSUPPORTED_Text
source: Looks like this type of raw photo is not supported yet. Sorry for that we will try to fix that.
ar: يبدو أن نوع الصورة هذا غير مدعوم. نحن أسفون سوف نعمل على إصلاح هذا
ru: Похоже, что данный формат не поддерживается. Это очень печально, но мы уже работаем над тем что бы увеличить количество поддерживаемых форматов.

# LIBRAW_FILE_UNSUPPORTED_Title
source: Not supported file type
ar: ملف غير مدعوم
ru: Не поддерживаемый формат файла

# LIBRAW_UNSUFFICIENT_MEMORY_text
source: Looks like there is not enough memory on your device. Sorry for that. Try to open a smaller image.
ar: يبدو انه لا توجد ذاكرة كافية لفتح هذه الصورة. حول فتح صورة اصغر
ru: Похоже, что на вашем телефоне не хватает памяти, что бы открыть этот файл даже в два раза меньшем размере. Это очень грустно. Попробуйте открыть что-нибудь другое.

# LIBRAW_UNSUFFICIENT_MEMORY_title
source: Not enough memory
ar: لا توجد ذاكرة كافية
ru: Не хватает памяти

# SettingsPageTitle
source: Settings
ar: الإعدادات
ru: Настройки

# SettingsPageAutoBrigtnessHeader
source: Auto brightness
ar: اضاءة تلقائية
ru: Автояркость

# SettingsPageHalfSizeHeader
source: Half size image. Open image 4x faster
ar: نصف حجم الصورة , 4 مرات اسرع
ru: Уменьшить фото в 2 раза, ускорив в 4 раза скорость открытия

# SettingsPageWhiteBalanceHeader
source: White balance from shot
ar: توازن اللون الابيض عند الألتقاط
ru: Брать баланс белого из профиля фото

# EditPageProgressBarWorking
source: Working...
ar: نعمل...
ru: Обрабатываю....

# ViewerPageProgressBarTextSwap
source: Updating image...
ar: تحديث الصورة...
ru: Обновляется изображение...

# SettingPageNoiseReductionHeader
source: Noise reduction (Increase open time)
ar: تقليل الضوضاء (يزيد زمن فتح الصورة)
ru: Подавление шума (замедлит открытие)

# MainPageAppBarLayoutGrid
source: grid
ar: شبكة
ru: таблица

# MainPageAppBarLayoutList
source: list
ar: قائمة
ru: список

# MainPageAppBarOpen
source: Open file
ar: فتح ملف
ru: Открыть

# MainPageFolderName
source: Camera Roll
ar: ألبوم الكاميرا
ru: Альбом камеры

# MainPageListBoxEmptyContent
source: Searching for .dng files in Camera Roll
ar: نبحث عن ملفات .dng في ألبوم الكاميرا
ru: Поиск .dng файлов в альбоме камеры

# MainPageListBoxSearching
source: Searching...
ar: نبحث …
ru: Поиск файлов...

# AboutPageThanksText
source: Special Thanks to: • Bruno Blanes (tradução para o Português) • Muntadhar Haydar (translation to Arabic) • Richard Yates (usefull tips and photo samples)
ar: شكر خاص ل: • Bruno Blanes • Muntadhar Haydar • Richard Yates
ru: Большая благодарность: • Muntadhar Haydar (Перевод на Арабский) • Bruno Blanes (Перевод на Португальский) • Richard Yates (Полезные советы и примеры фото)

# MainPageNoDNGFiles
source: It looks like there is no .DNG files in Camera roll. You can go to camera settings and switch on capture mode option to "jpeg+DNG" or select file from another location
ar: أية ملفات .dng. تمكين وضع RAW في إعدادات الكاميرا من نوكيا "JPEG + DNG" أو حدد الملف من موقع آخر
ru: Похоже, что у вас нет .DNG файлов в альбоме камеры. Для того что бы начать снимать в формате RAW, пройдите в настройки камеры и включите режим "jpeg+DNG". или выберите фаил из другой папки

# SettingsPageJpegQuality
source: JPEG export quality
ar: جودة الصادرات JPEG
ru: JPEG качество компрессии

# SettingPageFunnyTextHeader
source: Turn off funny text on loading page
ar: إيقاف النص مضحك على تحميل الصفحة
ru: Выключить текстовые подсказки

# ViewerPageLoaderText10
source: One of the biggest lens that you can easily buy weighs 15 kg. and costs $ 26 000. Sigma 200-500 / 2.8
ru: Название Canon произошло от слова Kwanon, в честь тысячерукого буддийского божества милосердия.

# ViewerPageLoaderText11
source: The most expensive photo is "Standing in a circle", made by Jeff Frost, and was sold for $ 6.5 million on November 8, 2011.
ru: Название Nikon произошло изначально от Nippon Kogaku, означает «Японская оптика».

# ViewerPageLoaderText12
source: The Canon name comes from the word Kwanon, in honor of the Buddhist deity of mercy with thousands of hands.
ru: Для портрета лучшая точка на уровне глаз.

# ViewerPageLoaderText13
source: Nikon was originally the name of Nippon Kogaku, meaning "Japanese optics".
ru: Для портрета в полный рост лучшая точка – на уровне пояса.

# ViewerPageLoaderText14
source: The best point for making a portrait is at eye level.
ru: Старайтесь кадрировать кадр так, чтобы линия горизонта не разделяла фотографию пополам. Зрителю будет легче сфокусировать внимание в кадре.

# ViewerPageLoaderText15
source: The best point for making a full-lenght portrait is at waist level.
ru: Снимая движущийся объект (автомобиль, велосипедиста), всегда оставляйте свободное пространство впереди объекта.

# ViewerPageLoaderText16
source: Try to crop the image so that the horizon line does not split the picture in half. The viewer will focus on the picture more easily.
ru: Первая «фотобумага» была из асфальта. Точнее, на медную или стеклянную пластину наносился асфальтовый лак.

# ViewerPageLoaderText17
source: When shooting a moving object (car, cyclist), always leave space in front of the object.
ru: Самая дорогая фотография - «Фантом», сделанная Питером Ликом, была продана за $6 500 000

# ImageInfoPageFlashAuto
source: auto
ar: تلقائي
ru: авто

# ImageInfoPageLocation
source: Location
ar: موقع
ru: Местоположение

# ViewerPageSaveCompletedNotDefault
source: Your picture is saved to phone
ar: تم حفظ الصورة لمكتبة
ru: Ваше изображение сохранено

# SettingPageSaveFileFormat
source: Save file format
ar: حفظ تنسيق الملف
ru: Формат сохраняемого файла

# SettingsPageDeleteAllFiles
source: How to delete
ar: حذف
ru: Удалять

# SettingsClearCacheButton
source: clear cache
ar: مسح ذاكرة التخزين المؤقت
ru: отчистить кеш

# SettingsClearCacheProgressText
source: Clearing cache
ar: مخبأ المقاصة
ru: Идет отчистка кеша

# BlurTool
source: Blur
ar: التشويش
ru: Размытие

# BrightnessTool
source: Brightness
ar: السطوع
ru: Яркость

# ContrastTool
source: Contrast
ar: التباين
ru: Контраст

# CropTool
source: Crop
ar: قطع
ru: Кадрирование

# ExposureTool
source: Exposure
ar: التعرض للضوء
ru: Экспозиция

# HighlightsTool
source: Highlights
ar: ويبرز
ru: Света

# HueTool
source: Hue
ar: الألوان
ru: Оттенки

# NoiseTool
source: NOISE
ar: الضوضاء
ru: Шум

# ResizeTool
source: Resize
ar: إعادة التحجيم
ru: Размер

# SaturationTool
source: Saturation
ar: التشبع
ru: Насыщенность

# ShadowsTool
source: Shadows
ar: الظلال
ru: Тени

# SharpnessTool
source: Sharpness
ar: الحِدة
ru: Резкость

# TemperatureTool
source: Temperature
ar: درجة الحرارة
ru: Температура

# UpgradePage12Proff
source: 12 Professional Tools
ar: 12 أدوات المهنية
ru: 12 Профессиональных инструментов

# ResourceFlowDirection
source: LeftToRight
ar: RightToLeft

# AboutPageAppBarEmail
source: Email
ar: البريد الألكتروني

# ImageInfoPageISO
source: ISO
ar: حساسية الضوء ISO
